app/views/blogs/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ?  [["blog_id", 3]]
---
        <%= link_to blog_favorites_path(blog), method: :delete do %>
         ♥<%= blog.favorites.count %>