app/views/blogs/search.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ?  [["blog_id", 5]]
---
        <%= link_to blog_favorites_path(blog), method: :delete do %>
         ♥<%= blog.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ?  [["blog_id", 5]]
---
        <%= link_to blog_favorites_path(blog), method: :post do %>
         ♡<%= blog.favorites.count %>