app/views/users/show.html.erb


    <h4><% if current_user.id == User.find_by(id:1).id %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]