app/controllers/blogs_controller.rb

  def index
    @blogs = @q.result.page(params[:page]).reverse_order
    @blogs_new = Blog.all.order(created_at: "DESC").limit(5) #新着
    # .order('count(blog.favorites) desc')
    @blogs_ran = Blog.select('blogs.*', 'count(favorites.id) AS favorites').
      left_joins(:favorites).
      group('blogs.id').
      order('favorites DESC').
      limit(5)
---
SELECT "blogs".* FROM "blogs"
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ?  [["blog_id", 1]]

  def new
    @blog = Blog.new
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    # byebug
    @blog = Blog.new(blog_params)
    @blog.user = current_user
    @blog.save
---
INSERT INTO "blogs" ("user_id", "genre_id", "image_id", "name", "price", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)