app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "0e6937508b739c9b287abf9947dbfde919cae1210dacf80353e3febd991f"], ["introduction", "z"], ["updated_at", "2021-05-04 09:19:30.206723"], ["id", 2]]
---
  def update
   @user=User.find(params[:id])
   @user.update(params_user)